bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
  Serial.println("LittleFS formatted successfully");

  // Now try to mount the freshly formatted filesystem
  if (!LittleFS.begin(false)) {
    Serial.println("Critical: Failed to mount LittleFS after successful format!");
    return;
  }

  Serial.println("LittleFS mounted successfully after format");
}

bool connectToMeshCore() {
  lastMeshConnectAttempt = millis();
  meshDeviceConnected = false;
  meshMessageCharacteristic = nullptr;
  meshChannelReady = false;

  Serial.printf("Scanning for MeshCore peer named '%s'...\n", BLE_PEER_NAME);

  BLEScan* scan = BLEDevice::getScan();
  scan->setActiveScan(true);
  BLEScanResults results = scan->start(5, false);

  for (int i = 0; i < results.getCount(); i++) {
    BLEAdvertisedDevice device = results.getDevice(i);
    if (device.getName() != BLE_PEER_NAME) {
      continue;
    }

    Serial.println("MeshCore peer found, attempting connection...");

    if (meshClient == nullptr) {
      meshClient = BLEDevice::createClient();
      meshClient->setClientCallbacks(new MeshClientCallbacks());
    }

    if (!meshClient->connect(&device)) {
      lastMeshError = "Connection attempt failed";
      continue;
    }

    BLERemoteService* service = meshClient->getService(MESHCORE_SERVICE_UUID);
    if (service == nullptr) {
      lastMeshError = "MeshCore service not found on peer";
      meshClient->disconnect();
      continue;
    }

    BLERemoteCharacteristic* characteristic = service->getCharacteristic(MESHCORE_MESSAGE_CHAR_UUID);
    if (characteristic == nullptr) {
      lastMeshError = "MeshCore message characteristic missing";
      meshClient->disconnect();
      continue;
    }

    if (!characteristic->canWrite()) {
      lastMeshError = "MeshCore message characteristic is not writable";
      meshClient->disconnect();
      continue;
    }

    meshMessageCharacteristic = characteristic;
    meshDeviceConnected = true;
    lastMeshError = "";
    Serial.println("Connected to MeshCore peer and ready to send messages");
    if (!ensureMeshChannel()) {
      meshClient->disconnect();
      meshDeviceConnected = false;
      return false;
    }

    return true;
  }

  lastMeshError = "MeshCore peer not found during scan";
  return false;
}

void maintainMeshCoreLink() {
  unsigned long now = millis();
  if (meshDeviceConnected && meshClient != nullptr && meshClient->isConnected()) {
    return;
  }

  if (now - lastMeshConnectAttempt < 10000) {
    return;
  }

  connectToMeshCore();
}

bool ensureMeshChannel() {
  if (meshChannelReady) {
    return true;
  }

  if (!meshDeviceConnected || meshMessageCharacteristic == nullptr) {
    return false;
  }

  if (!provisionMeshChannel()) {
    lastMeshError = "Mesh channel provisioning failed";
    return false;
  }

  meshChannelReady = true;
  return true;
}

bool provisionMeshChannel() {
  if (strlen(BLE_MESH_CHANNEL_NAME) == 0) {
    lastMeshError = "Mesh channel name missing";
    return false;
  }

  JsonDocument doc;
  doc["action"] = "ensure_channel";
  doc["channel"] = BLE_MESH_CHANNEL_NAME;
  doc["key"] = BLE_MESH_CHANNEL_KEY;

  String payload;
  serializeJson(doc, payload);

  Serial.printf("Provisioning MeshCore channel '%s'...\n", BLE_MESH_CHANNEL_NAME);
  try {
    meshMessageCharacteristic->writeValue(
      const_cast<uint8_t*>(reinterpret_cast<const uint8_t*>(payload.c_str())),
      payload.length(),
      false
    );
  } catch (...) {
    lastMeshError = "Failed to provision MeshCore channel";
    return false;
  }

  lastMeshError = "";

  return true;
}

void initWebServer() {

  server.on("/", HTTP_GET, [](AsyncWebServerRequest *request) {
    if (!ensureAuthenticated(request)) {
      return;
    }
    request->send(200, "text/html", getWebPage());
  });

  server.on("/api/mesh/status", HTTP_GET, [](AsyncWebServerRequest *request) {
    JsonDocument doc;
    doc["connected"] = meshDeviceConnected;
    doc["peerName"] = BLE_PEER_NAME;
    doc["deviceName"] = BLE_DEVICE_NAME;
    doc["channel"] = BLE_MESH_CHANNEL_NAME;
    doc["channelReady"] = meshChannelReady;
    doc["lastError"] = lastMeshError;

    String response;
    serializeJson(doc, response);
    request->send(200, "application/json", response);
  });

  server.on("/api/mesh/send", HTTP_POST, [](AsyncWebServerRequest *request) {}, NULL,
    [](AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total) {
      if (!ensureAuthenticated(request)) {
        return;
      }

      if ((!meshDeviceConnected || meshMessageCharacteristic == nullptr) && !connectToMeshCore()) {
        request->send(503, "application/json", "{\"error\":\"MeshCore device not connected\"}");
        return;
      }

      if (!ensureMeshChannel()) {
        request->send(503, "application/json", "{\"error\":\"MeshCore channel unavailable\"}");
        return;
      }

      JsonDocument doc;
      if (deserializeJson(doc, data, len) != DeserializationError::Ok) {
        request->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
        return;
      }

      String title = doc["title"] | "Mesh Message";
      String message = doc["message"] | "";
      if (message.length() == 0) {
        request->send(400, "application/json", "{\"error\":\"Missing message\"}");
        return;
      }

      sendMeshCoreNotification(title, message);

      request->send(200, "application/json", "{\"success\":true}");
    }
  );

  // get services
  server.on("/api/services", HTTP_GET, [](AsyncWebServerRequest *request) {
    JsonDocument doc;
    JsonArray array = doc["services"].to<JsonArray>();

    unsigned long currentTime = millis();

    for (int i = 0; i < serviceCount; i++) {
      if (services[i].lastCheck > 0) {
        services[i].secondsSinceLastCheck = (currentTime - services[i].lastCheck) / 1000;
      } else {
        services[i].secondsSinceLastCheck = -1; // Never checked
      }

      JsonObject obj = array.add<JsonObject>();
      obj["id"] = services[i].id;
      obj["name"] = services[i].name;
      obj["type"] = getServiceTypeString(services[i].type);
      obj["host"] = services[i].host;
      obj["port"] = services[i].port;
      obj["path"] = services[i].path;
      obj["expectedResponse"] = services[i].expectedResponse;
      obj["checkInterval"] = services[i].checkInterval;
      obj["passThreshold"] = services[i].passThreshold;
      obj["failThreshold"] = services[i].failThreshold;
      obj["consecutivePasses"] = services[i].consecutivePasses;
      obj["consecutiveFails"] = services[i].consecutiveFails;
      obj["isUp"] = services[i].isUp;
      obj["secondsSinceLastCheck"] = services[i].secondsSinceLastCheck;
      obj["lastError"] = services[i].lastError;
    }

    String response;
    serializeJson(doc, response);
    request->send(200, "application/json", response);
  });

  // add service
  server.on("/api/services", HTTP_POST, [](AsyncWebServerRequest *request) {}, NULL,
    [](AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total) {
      if (!ensureAuthenticated(request)) {
        return;
      }
      if (serviceCount >= MAX_SERVICES) {
        request->send(400, "application/json", "{\"error\":\"Maximum services reached\"}");
        return;
      }

      JsonDocument doc;
      DeserializationError error = deserializeJson(doc, data, len);

      if (error) {
        request->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
        return;
      }

      Service newService;
      newService.id = generateServiceId();
      newService.name = doc["name"].as<String>();

      String typeStr = doc["type"].as<String>();
      if (typeStr == "home_assistant") {
        newService.type = TYPE_HOME_ASSISTANT;
      } else if (typeStr == "jellyfin") {
        newService.type = TYPE_JELLYFIN;
      } else if (typeStr == "http_get") {
        newService.type = TYPE_HTTP_GET;
      } else if (typeStr == "ping") {
        newService.type = TYPE_PING;
      } else {
        request->send(400, "application/json", "{\"error\":\"Invalid service type\"}");
        return;
      }

      newService.host = doc["host"].as<String>();
      newService.port = doc["port"] | 80;
      newService.path = doc["path"] | "/";
      newService.expectedResponse = doc["expectedResponse"] | "*";
      newService.checkInterval = doc["checkInterval"] | 60;

      int passThreshold = doc["passThreshold"] | 1;
      if (passThreshold < 1) passThreshold = 1;
      newService.passThreshold = passThreshold;

